{
  "aboutMe_banner": "/images/uploads/kidlitconnection_openbooks_2.jpg",
  "aboutMe_subheading": "Hello, I’m Sue Lawrence, writer of children’s picture books that encourage, inform, and inspire.",
  "aboutMe_personalPhoto": "/images/uploads/sue-lawrence-08-24-2020_resized.jpg",
  "aboutMe_upperContent": "My debut picture book, __*Montana’s Memory Day*__, illustrated by 4-time published illustrator Erika Wilson, was published by Mascot Books on 11-5-2021.\n\nMy writing journey has been a roundabout one. I wrote poetry and a play as a teen, and won 1st place in a high school creative writing contest at age 17. Then, I didn’t write again until I was in my 50’s and trying to transition out of healthcare. I joined critique groups, took non-credit college courses, entered every writing contest I could find, and attended writers’ conferences with stay-awake-all-night excitement. I was fortunate enough to win a few of those writing contests. I also racked up enough rejection letters to wallpaper a home library.\n\nFinally, after working as a Registered Nurse for over 40 years (including college), I gave away or threw away all my belongings except for what would fit in my car and drove 1,900 miles from Alabama to Montana in two-days’-time—to attend college, second time around. I arrived on Rocky Mountain College’s Billings campus at 5:15 AM—sight unseen—three hours before the fall registration start time.\n\nThis go ‘round, I majored in English: creative writing and soaked up the college experience with new friends 40 years younger than me. When I earned my BA degree at age 60, I was the oldest graduate to walk across that commencement stage to receive a diploma. Now, at 62, I’ve published my debut children’s picture book. I don’t believe God gives us do-overs, but I’m a strong believer in the “do anew”! It’s NEVER too late to re-route your life’s course of action!",
  "aboutMe_lowerContent": "When I’m not reading or writing, I’m exploring Montana’s backroad scenery and small-town life—the smaller the town the better, in my book. I post photos and videos of my travels on my @montanaexplorer Instagram page, so folks who aren’t fortunate enough to live here can still get a feel for Montana’s good life. Montana’s my home now and I’m proud of it!",
  "aboutMe_gallery": [
    {
      "image": "/images/uploads/rmc-graduation-2019-photo-by-ty.jpg"
    },
    {
      "image": "/images/uploads/graduation-day-05-04-2019-sue-lawrence-photo-credit-marina-eshelman.jpg"
    },
    {
      "image": "/images/uploads/friend-zone-graduation-2019-photo-by-ty.jpg"
    }
  ]
}