{
  "klr_content_top": [
    {
      "title": "SCBWI (Society of Children’s Book Writers and Illustrators)",
      "content": "The SCBWI (Society of Children’s Book Writers and Illustrators) is one international professional membership **every** aspiring kidlit writer and illustrator should invest in. I’ve been a member since 2016 and the benefits are **more** than worth the cost of an annual membership ($95/year first year, then $80/year renewal annually after that. College/graduate student rate: $65/year to join, then $55/year renewal.)\n\nFind out about the professional development opportunities, book marketing and promotion, print and online resources, awards and grant opportunities, newsletters, and more on SCBWI’s Membership Benefits page: <https://www.scbwi.org/membership-benefits-new/>",
      "date": "2020-10-01"
    },
    {
      "title": "SCBWI Montana",
      "content": "When I first became a SCBWI member, a fellow writer suggested that the best way to stay in-the-know in the literary world of SCBWI, is to become a volunteer for them. I took her suggestion to heart, and initiated and maintain our regional Instagram page, [@SCBWIMontana](https://www.instagram.com/scbwimontana/). On our Instagram page you’ll read about kidlit conferences, webinars, awards, competitions, new book releases, helpful resources for kidlit writers and illustrators, and you’ll be introduced to some of our Montanan authors and illustrators.\n\nTo read our latest SCBWI Montana newsletter, or to learn more about/or to register for our regional events, please check out our website: [SCBWI Montana](https://montana.scbwi.org/).",
      "date": "2021-06-23"
    },
    {
      "title": "Montana Kids",
      "image": "/images/uploads/montanakids.com.jpg",
      "content": "[Montanakids.com](https://www.montanakids.com/) provides a slew of info about Montana. They discuss our state’s history and statistics, main agricultural and business products, plants and animals, things to see and do, games and activities, and tell a few Montana-themed stories along the way.",
      "date": "2020-10-10"
    },
    {
      "title": "Magazine Markets for Children’s Writers",
      "image": "/images/uploads/Magazine Markets for Children's Writers - 2021 Edition.jpg",
      "content": "This resource lists North American magazine markets that buy freelance editorial material for children and teens, their parents, and teachers. Included are publishers, submission guidelines, and rights and payment information, as well as writing contests, conferences, and current industry news. It sells for $21.95, direct from the publisher, Institute for Writers. Their website is instituteforwriters.com.",
      "date": "2021-06-23"
    }
  ],
  "klr_banner": "/images/uploads/kidlitconnection_children_2.png",
  "klr_subheading": "An up-to-date listing of conferences, books, courses, and other things of interest to kidlit authors!",
  "klr_content_conferences": [
    {
      "title": "SCBWI & Smithsonian Nonfiction Workshop",
      "content": "The SCBWI & Smithsonian Nonfiction Workshop is scheduled for Friday and Saturday, November 6-8, 2020. There will be keynote speakers, book editor panels, author panels, special topics and more of interest to kidlit nonfiction writers and illustrators. Registration, faculty bios, and workshop schedule for this virtual workshop are at <https://www.scbwi.org/events/nonfiction-workshop/> .",
      "date": "2020-10-10"
    }
  ],
  "klr_content_additional": [
    {
      "title": "Montana Kids",
      "image": "/images/uploads/montanakids.com.jpg",
      "content": "[Montanakids.com](https://www.montanakids.com/) provides a slew of info about Montana. They discuss our state’s history and statistics, main agricultural and business products, plants and animals, things to see and do, games and activities, and tell a few Montana-themed stories along the way.",
      "date": "2020-10-10"
    }
  ]
}