{
  "klr_content_top": [
    {
      "title": "SCBWI (Society of Children’s Book Writers and Illustrators)",
      "content": "The SCBWI (Society of Children’s Book Writers and Illustrators) is one international professional membership **every** aspiring kidlit writer and illustrator should invest in. I’ve been a member since 2016 and the benefits are **more** than worth the cost of an annual membership ($95/year first year, then $80/year renewal annually after that. College/graduate student rate: $65/year to join, then $55/year renewal.)\n\nFind out about the professional development opportunities, book marketing and promotion, print and online resources, awards and grant opportunities, newsletters, and more on SCBWI’s Membership Benefits page: <https://www.scbwi.org/membership-benefits-new/>\n\nWhen you join SCBWI, you automatically become a member of your region’s local chapter—which in our case, is Montana. Find out about our regional events at <https://montana.scbwi.org/>.",
      "date": "2020-10-01"
    }
  ],
  "klr_banner": "/images/uploads/kidlitconnection_children_2.png",
  "klr_subheading": "An up-to-date listing of conferences, books, courses, and other things of interest to kidlit authors!",
  "klr_content_conferences": [
    {
      "title": "SCBWI & Smithsonian Nonfiction Workshop",
      "content": "The SCBWI & Smithsonian Nonfiction Workshop is scheduled for Friday and Saturday, November 6-8, 2020. There will be keynote speakers, book editor panels, author panels, special topics and more of interest to kidlit nonfiction writers and illustrators. Registration, faculty bios, and workshop schedule for this virtual workshop are at <https://www.scbwi.org/events/nonfiction-workshop/> .",
      "date": "2020-10-10"
    }
  ],
  "klr_content_additional": [
    {
      "title": "test additional",
      "content": "this is some test content",
      "date": "2020-10-11"
    },
    {
      "title": "Montana Kids",
      "image": "/images/uploads/montanakids.com.jpg",
      "content": "[Montanakids.com](https://www.montanakids.com/) provides a slew of info about Montana. They discuss our state’s history and statistics, main agricultural and business products, plants and animals, things to see and do, games and activities, and tell a few Montana-themed stories along the way.",
      "date": "2020-10-10"
    }
  ]
}