{
  "myBooks_content_top": "I write kidlit for preschoolers to middle graders—from fiction to nonfiction—but, in all my books one thing shows through: they’re all rooted in the truth in some way.\n\nMontana’s Memory Day is a realistic fiction picture book for ages 5 and up inspired by a compilation of the life stories of several real people.\n\nMy WWII-themed work-in-progress is nonfiction for ages 8-12. It’s about two women who worked behind-the-scenes doing top secret work for America’s government during wartime.",
  "myBooks_subheading": "I'm so happy you're here to learn more about my forthcoming book and my WWII themed work-in-progress!",
  "myBooks_content_mmd": "\n\nMy debut picture book, Montana’s Memory Day, is a nature-themed foster-to-adoption story set on a farm in Montana. It is being illustrated by 2-time published illustrator, Erika Wilson, who is also a 3rd generation Montana farmer, small business owner, former educator, and mom. Montana’s Memory Day will launch in the fall of 2021 from Mascot Books.\n\nI wrote this book to fulfill a need. I did not grow up as a foster kid, but I married two men who did. That is why I wrote this story—to give voice to older foster kids and teens who are grossly underrepresented in children’s books today. I struggled to find comparable titles that highlight the mixed feelings and inner struggles of this demographic in a relatable and understandable way. When I couldn’t find such a story, I wrote one.\n\nIllustrating a picture book is an artform. Once completed, Erika will have spent 14 months and hundreds of hours illustrating Montana’s Memory Day using a linocut print and watercolor method. In the video she’s carving one of the book’s page spreads out of lino (short for linoleum). It’s a meticulous and time-intensive task that she enjoys (she says!).\n\nYou can find out more about Erika Wilson at these locations.\n\n* Website: [erikawilsonart.com](https://erikawilsonbooks.com/)\n* Instagram: [@erikawilsonart](https://www.instagram.com/erikawilsonart/) and [@windymillpress](https://www.instagram.com/windymillpress/)",
  "myBooks_banner": "/images/uploads/kidlitconnection_blueforest_2.jpg",
  "myBooks_content_wip": "Peggy Davis and Mildred Mahan were not alike. They weren’t friends, either. In fact, they barely knew each other. But, for 18 months in the 1940’s, these cousins from Alabama shared an apartment while working for separate top government organizations in Washington, DC.\n\nThey never talked about the work they did—not even to each other. They had been sworn to secrecy and weren’t allowed to talk about it or write about it—to anyone. But, what they did behind-the-scenes was top secret work and highly classified and forever impacted the course of America’s national and military history."
}