{
  "myBooks_content_top": "I write kidlit for preschoolers to middle graders—from fiction to nonfiction—but, in all my books one thing shows through: they’re all rooted in the truth in some way.\n\nMontana’s Memory Day is a realistic fiction picture book for ages 5 and up inspired by a compilation of the life stories of several real people.\n\nMy WWII-themed work-in-progress is nonfiction for ages 8-12. It’s about two women who worked behind-the-scenes doing top secret work for America’s government during wartime.",
  "myBooks_subheading": "I'm so happy you're here to learn more about my forthcoming book and my WWII themed work-in-progress!",
  "myBooks_content_mmd": "__*Montana’s Memory Day: a nature-themed foster/adoption story*__ was illustrated by Erika Wilson, a 3rd generation Montanan. She used her family farm as inspiration, and her nephew and sister-in-law acted as live models in reference photos for the characters of Montana and New Mom.  \n\nUsing a hand-carved linocut print-making method, she made Montana’s inner thoughts come alive. Some of the double-page spreads took Erika over 30 hours to carve by hand; not counting the tracing, printing, and watercolor painting time involved. It took her 12 months to complete the illustrations for this picture book.\n\nI wrote __*Montana’s Memory Day*__ to fulfill a need. I did not grow up as a foster kid, but I married two men who did. That is why I wrote this story—to give voice to foster kids and teens who are underrepresented in the children’s book market today. When I couldn’t find books that highlight the inner struggles of former foster kids in a relatable way, I wrote one.\n\nThis story began as a combination of two class assignments in a Special Topics class, taught by associate professor of English, Precious McKenzie, at Rocky Mountain College. The 10-student creative writing class was called “Writing for Children and Young Adults.”\n\nI have revised and re-revised, revamped, and rewritten parts of this book’s manuscript many times over since that class. When I say “many times over” I mean just that: I wrote close to 300 manuscripts of this picture book. It’s only 374 words in length, but it took two and a half years to produce. It was critiqued by my college classmates, SCBWI Montana Billings’ critique group, and several other individuals before I submitted it to my hybrid book publisher, Mascot Books. After every new critique, I revised and rerevised yet again. Then, it was thoroughly edited by Mascot’s senior production editor, Nicole Hall. That was a multi-step process, also.\n\n",
  "myBooks_content_mmd_lower": "So, this has been a time-intensive endeavor, but a rewarding one. Because I was doing what I love it felt “right” and I enjoyed the process of bringing a book—my book—to life. Fellow writers, don’t let anyone tell you that writing a picture book is “easy”—it isn’t. It’s satisfying and challenging, yes—but it entails significant time, energy, and downright stick-to-it gumption!\n\nIt feels so good to say, “I’m a children’s book author.” I can’t wait to write that in as my “occupation” on my federal income tax forms next year!",
  "myBooks_banner": "/images/uploads/kidlitconnection_blueforest_2.jpg",
  "myBooks_content_wip": "Peggy Davis and Mildred Mahan were not alike. They weren’t friends, either. In fact, they barely knew each other. But, for 18 months in the 1940’s, these cousins from Alabama shared an apartment while working for separate top government organizations in Washington, DC.\n\nThey never talked about the work they did—not even to each other. They had been sworn to secrecy and weren’t allowed to talk about it or write about it—to anyone. But, what they did behind-the-scenes was top secret work and highly classified and forever impacted the course of America’s national and military history."
}